package day21;
	//创建一个多线程程序，main方法为主线程，main方法中调用的其他方法为子线程
	//多线程实现方式 1、继承Thread类（不推荐） 2、实现Runnable接口(推荐)

class XianCheng1 extends Thread{
	public void run(){
		for(int i = 0 ; i < 20 ; i++){
			System.out.println(Thread.currentThread().getName() + "+++++++++++++++++++" + i);
		}
	}
}
public class Demo05 {
	public static void main(String[] args) {
		Thread t = new XianCheng1();
		t.start();
		for(int i = 0 ; i < 20 ; i++){
			if(i == 10){
				throw new ArithmeticException();//一个线程中途出现异常，则停止这个线程，其他线程继续运行
			}
			System.out.println(Thread.currentThread().getName() + "-----------------------------" + i);
		}
	}
	
}
/*
 *运行结果为：
 * main-----------------------------0
Thread-0+++++++++++++++++++0
main-----------------------------1
Thread-0+++++++++++++++++++1
main-----------------------------2
Thread-0+++++++++++++++++++2
main-----------------------------3
Thread-0+++++++++++++++++++3
main-----------------------------4
Thread-0+++++++++++++++++++4
main-----------------------------5
Thread-0+++++++++++++++++++5
main-----------------------------6
Thread-0+++++++++++++++++++6
Thread-0+++++++++++++++++++7
Thread-0+++++++++++++++++++8
Thread-0+++++++++++++++++++9
Thread-0+++++++++++++++++++10
Thread-0+++++++++++++++++++11
Thread-0+++++++++++++++++++12
Thread-0+++++++++++++++++++13
Thread-0+++++++++++++++++++14
Thread-0+++++++++++++++++++15
Thread-0+++++++++++++++++++16
Thread-0+++++++++++++++++++17
Thread-0+++++++++++++++++++18
Thread-0+++++++++++++++++++19
main-----------------------------7
main-----------------------------8
main-----------------------------9
main-----------------------------10
main-----------------------------11
main-----------------------------12
main-----------------------------13
main-----------------------------14
main-----------------------------15
main-----------------------------16
main-----------------------------17
main-----------------------------18
main-----------------------------19
 * 
 * 
 * */
 